#ifndef MEMORY_POOL_IFACE_H
#define MEMORY_POOL_IFACE_H

/** ****************************************************************************
 * @defgroup memory Пул памяти.
 * @{
 *
 * @brief Интерфейс для взаимодействия с абонентами
 * внешней системной шины.
 *
 * @file memoryPoolIface.h
 *
 * @author Петров А.С.
 * ****************************************************************************/


/* --- Подключение заголовочных файлов ---------------------------------------*/

// Стандартная библиотека языка Си
#include <stddef.h> // Стандартные определения
#include <stdbool.h> // Булевы определения


/** ****************************************************************************
 * @brief Интерфейсная структура для реализаций пула.
 * @struct sMemoryPoolIface
 * ****************************************************************************/
typedef struct
{
    /// @brief Выделение памяти.
    /// @param [in] size Размер выделяемой памяти в байтах.
    /// @return 0 - ошибка при выделении, иначе указатель на выделенную область.
    void *( *allocate )( size_t size);

    /// @brief Освобождение памяти, выделенной с помощью @ref allocate.
    /// @param [in] pData Блок памяти для освобождения.
    /// @return true - успешное освобождение памяти, false - ошибка.
    bool ( *deallocate )( void *pData );
} sMemoryPoolIface;


/** @} */ // memory

#endif // MEMORY_POOL_IFACE_H
